# символ присутствует в строке
# 'O' in i
# i.count('O') >= 1

# символ встречается в строке определенное кол-во раз
# i.count('K') == 2

# символ не встречается в строке
# 'IG' not in i
# i.count('IG') == 0

           # В любой задаче с числами не обходимо проверять,
           # что число не начинается на ноль
             '''''''''' '''''''' 'if i[0] != '0':'''''''''''
if len(i) == len(set(i)):'''''''''''''''
    # Проверка, что строка не начинается на какой-то символ
    # Проверка, что каждый символ использовался ровно 1 раз'''''''''''''