# Истинные значения принимают - ненулевые числа и непустые объекты
var_int = 8 # любое число неравное нулю
var_float= 9.3 # любое дробное число неравное нулю
var_str = 'test' # непустая строка
var_list = ['henlo', 9] # непустой список
var_tuple = (1, 8.9) # непустой кортеж
var_set = {1, '5', 9.8} # непустое множество
var_dict = {'name':'Anton'} # непустой словарь
var_bool = True

# Ложные значения принимают - нуль и пустые объекты
var_int2 = 0
var_float2= 0.0
var_str2 = ''
var_list2 = []
var_tuple2 = ()
var_set2 = {}
var_dict2 = {}
var_bool2 = False